export const uk = {
    header: {
        "tournaments": "Турніри",
        "teams": "Команди",
        "support": "Підтримати",
        "availableTournaments": "Доступні турніри",
        "myCurrentTournaments": "Мої поточні",
        "history": "Історія",
        "profile": "Профіль",
        "logout": "Вийти",
        "login": "Увійти",
        "manageTournaments": "Керування турнірами",
        "allTeams": "Всі команди",
        "adminPanel": "Адмін-панель",
        "mySubmissions": "Роботи на перевірку",
        "myTeam": "Моя команда",
        "role": "Роль: ",
        "notifications": "Повідомлення",
        "calendar": "Календар",
    },
    login: {
        "title": "Перенаправлення на сторінку входу. Будь ласка, зачекайте...",
    },
    footer: {
        "description": "Цифрова платформа для проведення хакатонів та конкурсів від благодійного фонду Star for Life Ukraine.",
        "tournaments": "Турніри",
        "available": "Доступні",
        "myTournaments": "Мої турніри",
        "teams": "Команди",
        "myTeams": "Мої команди",
        "contacts": "Контакти",
        "founded": "Засновано: 30.01.2023",
        "rights": "Всі права захищено",
        "terms": "Умови використання",
        "privacy": "Політика конфіденційності",
        "register": "ЄДРПОУ: 44977372"
    },

    languages: {
        en: "Англійська",
        uk: "Українська",
    },


    common: {
        "save": "Зберегти",
        "saving": "Зберігання...",
        "cancel": "Скасувати",
        "loading": "Завантаження...",
        "error": "Сталася помилка",
        "success": "Успішно виконано",
        "back": "Назад",
        "authenticating": "Аутентифікація",
        "authenticatingSubtitle": "Зачекайте, будь ласка",
        "edit": "Редагувати",
        "delete": "Видалити",
        "add": "Додати",
        "adding": "Додати",
        "no_options": "Немає опцій",
        "confirm_promote": "Підтвердження підвищення до лідера",
        "yes_confirm": "Підтвердити",
        "no": "Скасувати",
        "search": "Пошук",
        "errors": "Виправте ці помилки",
        "warning": "Будьте обережні зі зміною статуса. Адже система змінит дати сама на відповідні, якщо користувач не вказав відповідні",
        "ok": "Ok",
        "points_short": "балів",
        "goHome": "На головну",
        "close": "Закрити",
        "post": "Опублікувати",
        "confirm_delete": "Ви впевнені, що хочете видалити це повідомлення?",
        "refresh": "Оновити",
        "unknownDate": "Невідома дата",
        "selected": "Обрано",
        "click_to_view": "Click to view",
    },

    announcements: {
        "messages": {
            "title": "Оголошення",
            "add": "Створити",
            "empty": "Оголошень поки немає",
            "create_title": "Нове оголошення",
            "edit_title": "Редагувати оголошення",
            "placeholder": "Напишіть щось важливе для команд..."
        },
        "events": {
            "title": "Розклад",
            "add": "Подія",
            "empty": "Розклад поки порожній",
            "view_title": "Деталі події",
            "create_title": "Створення події",
            "edit_title": "Редагування події",
            "label_title": "Назва події",
            "type": "Тип проведення",
            "start": "Час початку",
            "end": "Час завершення",
            "desc": "Опис",
            "link": "Посилання на зустріч",
            "location": "Локація (адреса)"
        }
    },
    global: {
        "page_title": "Центр сповіщень",
        "tabs": {
            "announcements": "Глобальні новини",
            "notifications": "Мої сповіщення"
        },
        "notifications": {
            "empty": "У вас поки немає особистих сповіщень"
        }
    },
    errors: {
        "403": {
            "title": "Доступ заборонено",
            "description": "У вас немає прав для перегляду цієї сторінки. Будь ласка, зверніться до адміністратора, якщо ви вважаєте, що це помилка."
        },
        "404": {
            "title": "Упс! Сторінку не знайдено",
            "description": "Схоже, сторінка, яку ви шукаєте, не існує, була видалена або тимчасово недоступна."
        }
    },

    home: {
        "title": "Керуйте турнірами легко",
        "description": "Єдина платформа для організації змагань, керування командами та прозорого оцінювання результатів у реальному часі.",
        "how_it_works": {
            "title": "Як це працює?",
            "steps": {
                "step1": {
                    "title": "Реєстрація",
                    "desc": "Створіть свій профіль та отримайте доступ до списку актуальних турнірів у вашому регіоні чи онлайн."
                },
                "step2": {
                    "title": "Формування команди",
                    "desc": "Знайдіть однодумців, створіть свою команду або приєднайтеся до вже існуючої для участі в змаганнях."
                },
                "step3": {
                    "title": "Шлях до перемоги",
                    "desc": "Виконуйте завдання раундів, отримуйте бали від професійного журі та піднімайтеся на вершину таблиці лідерів."
                }
            }
        }
    },

    profile: {
        "title": "Мій профіль",
        "role": "Роль у системі",
        "teams": "Мої команди",
        "tournaments": "Мої турніри",
        "no_teams": "Ви ще не приєдналися до жодної команди",
        "no_tournaments": "Немає активних турнірів на даний момент",
        "error_loading": "Не вдалося завантажити дані профілю",
        "buttons": {
            "edit": "Редагувати профіль"
        },
        "fields": {
            "full_name": "ПІБ",
        },
        "statuses": {
            "RUNNING": "Триває",
            "COMPLETED": "Завершено",
            "REGISTRATION": "Реєстрація"
        }
    },

    tournaments: {
        "title": "Турніри",
        "admin_title": "Панель керування турнірами",
        "subtitle": "Слідкуйте за своїми результатами та знаходьте нові змагання.",
        "search_placeholder": "Пошук за назвою...",
        "no_data": "Турнірів не знайдено",
        "tabs": {
            "available": "Доступні",
            "my_registed": "Зареєстрований я на",
            "my": "Моя участь",
            "history": "Минулі",
            "admin": "Адміністрування"
        },
        "card": {
            "more_info": "Детальніше",
            "no_data": "У цій категорії наразі немає турнірів."
        },
        "statuses": {
            "REGISTRATION": "Реєстрація",
            "RUNNING": "Триває",
            "FINISHED": "Завершено",
            "DRAFT": "Чернетка",
            "ALL" : "Усі"
        },
        "admin": {
            "create_button": "Створити турнір",
            "modal_title": "Новий турнір",
            "submit": "Створити",
            "cancel": "Скасувати",
            "backToList": "До списку",
            "fields": {
                "name": "Назва турніру",
                "description": "Опис",
                "startTournament": "Дата старту",
                "startReg": "Початок реєстрації",
                "endReg": "Кінець реєстрації",
                "maxTeams": "Макс. кількість учасників у команді",
                "rounds": "К-сть раундів"
            }
        }
    },
    tournament_details: {
        "header": {
            startDate: "Старт:",
            registered: "Ви зареєстровані",
            register_btn: "Зареєструватися"
        },
        "tabs": {
            info: "Інформація",
            rounds: "Раунди",
            teams: "Команди"
        },
        "info": {
            "reg_period": "Період реєстрації",
            "max_teams": "Максимальна кількіть учасників у команді",
            "rounds_count": "Кількість раундів",
            "no_description": "Опис для цього турніру ще не додано."
        },
        "rounds": {
            "title": "Раунди турніру",
            "empty": "У цьому турнірі ще не створено жодного раунду."
        },
        "teams": {
            "empty": "На цей турнір ще не зареєстровано жодної команди."
        },
        "admin": {
            "edit_info": "Редагувати турнір",
            "add_round": "Додати раунд",
            "create_modal": {
                "title": "Створення нового раунду",
                "name": "Назва раунду",
                "name_placeholder": "Опишіть завдання для учасників на цей етап...",
                "start": "Дата початку",
                "end": "Дата завершення",
                "winners": "Кількість учасників, що пройдуть далі",
                "task": "Текст завдання",
                "requ": "Вимоги",
                "submit": "Створити раунд"
            }
        },
        "control_panel": "Керування турніром",
        "actions": {
            "openRegistration": "Відкрити реєстрацію",
            "startTournament": "Почати турнір",
            "completeTournament": "Завершити турнір",
            "backToDraft": "Повернути в чернетку",
            "cancelStart": "Скасувати старт",
            "reopenTournament": "Скасувати завершення"
        },
        "dialog": {
            "startRegTitle": "Відкрити реєстрацію?",
            "startRegDesc": "Турнір стане публічним, і команди зможуть подавати заявки.",
            "startTourTitle": "Почати змагання?",
            "startTourDesc": "Реєстрація буде закрита. Почнеться формування сітки раундів.",
            "finishTitle": "Завершити турнір?",
            "finishDesc": "Всі результати будуть зафіксовані остаточно.",
            "toDraftTitle": "Повернути в чернетку?",
            "toDraftDesc": "Реєстрація буде скасована, турнір зникне з публічного списку.",
            "rollbackStartTitle": "Скасувати старт?",
            "rollbackStartDesc": "Турнір повернеться на етап збору заявок (Registration).",
            "rollbackFinishTitle": "Повернути в роботу?",
            "rollbackFinishDesc": "Турнір знову отримає статус 'Running'.",
            "deleteTitle": "Видалити турнір?",
            "deleteDesc": "Це назавжди видалить турнір, всі команди та раунди. Дія незворотна."
        }
    },
    "control_panel": "Панель керування",
    "actions": {
        "openRegistration": "Відкрити реєстрацію",
        "startTournament": "Розпочати турнір",
        "backToDraft": "Повернути до чернетки",
        "completeTournament": "Завершити турнір",
        "cancelStart": "Скасувати старт",
        "reopenTournament": "Відновити турнір"
    },
    "dialog": {
        "startRegTitle": "Початок реєстрації",
        "startRegDesc": "Ви впевнені, що хочете відкрити реєстрацію на цей турнір? Користувачі зможуть подавати заявки.",
        "startTourTitle": "Старт турніру",
        "startTourDesc": "Ви впевнені, що хочете розпочати турнір? Це згенерує турнірну сітку та закриє реєстрацію.",
        "toDraftTitle": "Повернути до чернетки",
        "toDraftDesc": "Ви впевнені, що хочете повернути цей турнір до статусу чернетки? Це закриє активну реєстрацію.",
        "finishTitle": "Завершити турнір",
        "finishDesc": "Ви впевнені, що хочете позначити цей турнір як завершений? Більше жодних матчів не можна буде зіграти.",
        "rollbackStartTitle": "Скасувати старт турніру",
        "rollbackStartDesc": "Ви впевнені, що хочете скасувати старт турніру? Це поверне його до етапу реєстрації та видалить поточний прогрес у сітці.",
        "rollbackFinishTitle": "Відновити турнір",
        "rollbackFinishDesc": "Ви впевнені, що хочете відновити цей завершений турнір?",
        "deleteTitle": "Видалити турнір",
        "deleteDesc": "Ви абсолютно впевнені, що хочете видалити цей турнір? Ця дія є незворотною."
    },

    modals: {
        "add_teams": {
            "title": "Додати команди до раунду",
            "search_placeholder": "Пошук команд...",
            "available_header": "Доступні команди:",
            "select_all": "Вибрати всі",
            "no_teams": "Команд не знайдено",
            "submit": "Додати ({{count}})"
        },
        "advance_teams": {
            "title": "Перевести команди",
            "target_round": "Цільовий раунд",
            "subtitle": "Перегляньте команди для переведення (переможці вибрані):",
            "advancing_status": "Проходить",
            "submit": "Перевести ({{count}}) команд"
        }
    },

    teams: {
        "title": "Команди",
        "admin_title": "Реєстр команд",
        "subtitle": "Учасники та спільноти платформи",
        "search_placeholder": "Пошук команди за назвою...",
        "no_data": "Команд не знайдено",
        "actions": {
            "create": "Зареєструвати команду"
        },
        "card": {
            "more_info": "Профіль команди"
        },
        "confirm_delete_title": "Видалити команду?",
        "confirm_delete_text": "Ви впевнені що хочете видалити команду?(Неможливо відмінити цю дію)",
    },
    team_create: {
        "title": "Реєстрація команди",
        "subtitle": "Заповніть дані для участі у турнірі",
        "back": "Назад до турніру",
        "success": "Команду успішно зареєстровано!",
        "registration": "Реєстрація...",
        "regis": "Зареєструвати команду",
        "team_members": "Склад команди",
        "fields": {
            "name": "Назва команди",
            "contact_email": "Контактний Email",
            "org_name": "Організація / Університет",
            "contact_some": "Телефон або Telegram",
            "leaders_name": "ПІБ капітана",
            "leaders_email": "Email капітана",
            "members_name": "Учасник",
            "members_email": "Email",
            "select_team": "Оберіть команду",
        },
        "errors": {
            "choose_tournament": "ID турніру відсутній. Будь ласка, поверніться назад.",
            "name_needed": "Введіть назву команди.",
            "email_needed": "Контактний email обов'язковий.",
            "users_incomplete": "Будь ласка, заповніть дані всіх учасників.",
            "min_members": "У команді має бути хоча б один учасник.",
            "error": "Не вдалося створити команду. Спробуйте ще раз."
        },
        "method_new": "Нова команда",
        "method_existing": "Обрати існуючу",
    },
    team_details: {
        "status": {
            "locked_started": "Заблоковано для змін"
        },
        "reasons": {
            "TOURNAMENT_STARTED": "Не можна змінити склад команди коли турнір почався",
            "NOT_LEADER": "Тільки лідер команди може змінювати",
            "NOT_FOUND": "Не знайдено такого учасника"
        },
        "not_found": "Команду не знайдено",
        "tabs": {
            "info": "Інформація",
            "members": "Учасники",
            "tournaments": "Турніри"
        },
        "info": {
            "team_name": "Назва команди",
            "org_name": "Організація / Заклад",
            "contact_person": "Контактна особа",
            "email": "Контактний Email"
        },
        "members": {
            "title": "Склад команди"
        },
        "tournaments": {
            "title": "Історія турнірів",
            "coming_soon": "Список турнірів з'явиться найближчим часом."
        },
        "admin": {
            "edit_info": "Редагувати дані",
            "save": "Зберегти зміни",
            "cancel": "Скасувати",
            "add_member": "Додати учасника",
            "delete_confirm": "Ви впевнені, що хочете видалити цю команду?",
            "delete_member_confirm": "Ви впевнені, що хочете видалити цього учасника з команди?",
            "make_leader": "Призначити капітаном",
            "remove_member": "Видалити з команди",
            "member_modal": {
                "some_title": "Новий учасник",
                "full_name": "Прізвище та ім'я",
                "email": "Електронна пошта",
                "is_leader": "Призначити капітаном",
                "submit": "Додати до складу"
            }
        },
        "errors": {
            "fetch_failed": "Не вдалося завантажити дані команди",
            "update_failed": "Помилка при оновленні даних",
            "add_member_failed": "Не вдалося додати учасника",
            "remove_member_failed": "Помилка при видаленні",
            "promote_failed": "Не вдалося змінити капітана"
        },
        "confirm": {
            "remove_title": "Видалити цього учасника?",
            "remove_text": "Точно?"
        },
        "confirm.promote_text": "Підвищити до лідера корпистувача",
    },

    jury: {
        "custom_criteria_title": "Додаткові бали (на розсуд журі)",
        "custom_criteria_name": "Назва додаткового критерію",
        "score": "Бал",
        "max_points": "Макисмальна кільксість балів",
        "add_custom_criteria": "Додати критерій",
        "comment_placeholder": "Коментар для команди",
        "custom_criteria_desc": "Ви можете додати власні критерії для оцінювання унікальних рішень. Кожен додатковий критерій оцінюється від 0 до 5 балів.",
        "submissions_title": "Очікують на розгляд",
        "submissions_subtitle": "Будь ласка, перевірте проєкти, надіслані командами",
        "evaluate_title": "Оцінювання проєкту",
        "team": "Команда",
        "links": "Матеріали",
        "no_submissions": "Наразі немає проєктів для перевірки",
        "evaluation_form": {
            "score": "Бал",
            "comment": "Коментар для команди",
            "placeholder_comment": "Ваші нотатки або поради...",
            "submit": "Завершити оцінювання",
            "success": "Оцінку збережено!"
        },
        "criteria": "Критерії оцінювання",
        "actions": {
            "evaluate": "Оцінити",
            "save_scores": "Зберегти бали",
        },
        "round_label": "Раунд",
        "view_github": "Посилання на GitHub",
        "view_video": "Посилання на YouTube/Google Диск",
        "submission_desc": "Опис проєкту",
        "grading_rubric": "Рубрика оцінювання",
        "category_weight": "Вага",
        "score_0_100": "Бал 0-100",
        "no_categories": "Немає доступних категорій",
        "info.round_evaluated": "Цей раунд завершено. Оцінки доступні лише для перегляду і не можуть бути змінені.",
        "success.scores_saved": "Оцінки були збережені",
        "errors": {
            "load_list_failed": "Помилка завантаження списку",
        },
        "status": {
            "pending": "Надіслано на перевірку",
            "evaluated": "Перевірка закінчена",
        },
    },
    juries: {
        "management_title": "Менеджемнт журі",
        "management_subtitle": "Сторінку менеджменту журі",
        "tabs": {
            "list": "Лист",
            "create": "Створити"
        },
        "search_placeholder": "Шукати",
        "delete_confirm": "Ви впевнені що хочете видалити цього журі?",
    },
    create_jury: {
        "title": "Нове журі",
        "subtitle": "Заповніть дані, щоб додати нового члена журі до системи",
        "success": "Члена журі успішно створено!",
        "fields": {
            "full_name": "Повне ім'я (ПІБ)",
            "email": "Електронна пошта"
        },
        "actions": {
            "submit": "Створити журі",
            "creating": "Створення..."
        },
        "errors": {
            "generic": "Не вдалося створити журі. Перевірте дані та спробуйте ще раз."
        }
    },

    rounds: {
        "status": "Статус раунду",
        "statuses": {
            "DRAFT": "Підготовка",
            "ACTIVE": "Прийом робіт",
            "SUBMISSION_CLOSED": "На перевірці",
            "EVALUATED": "Завершено"
        }
    },
    round_details: {
        "export_leaderboard": "Експортувати таблицю лідерів",
        "not_found": "Раунд не знайдено",
        "header": {
            "dates": "Дати:",
            "winners": "Переможців(учасників):"
        },
        "tabs": {
            "info": "Інформація",
            "categories": "Категорії",
            "jury": "Журі",
            "teams": "Команди",
            "leaderboard": "Команди(Leaderboard)",
            "submissions": "Роботи надіслані на перевірку",
            "stats": "Statistics",
            "tasks": "Завдання команди",
            "announcements": "Оголошення та події",
            "certificates": "Сертифікати"
        },
        "tasks": {
            "title": "Завдання команди",
            "add_btn": "Додати завдання",
            "empty": "Завдань для вашої команди в цьому раунді поки немає.",
            "assigned_to": "Виконує",
            "edit_title": "Редагувати завдання",
            "create_title": "Створити нове завдання",
            "form": {
                "title": "Назва завдання",
                "description": "Опис",
                "type": "Тип завдання",
                "priority": "Пріоритет",
                "status": "Поточний статус"
            },
            "enums": {
                "status": {
                    "TODO": "Треба зробити",
                    "IN_PROGRESS": "В процесі",
                    "DONE": "Готово",
                    "BLOCKED": "Заблоковано"
                },
                "type": {
                    "BUG": "Баг",
                    "IMPROVEMENT": "Покращення",
                    "FEATURE": "Фіча",
                    "OPTIONAL": "Опціонально"
                },
                "priority": {
                    "HIGH": "Високий",
                    "MEDIUM": "Середній",
                    "LOW": "Низький"
                }
            }
        },
        "info": {
            "name": "Назва раунду",
            "status": "Статус",
            "start_date": "Початок",
            "end_date": "Кінець",
            "winners_count": "Кількість переможців(учасників)",
            "task": "Завдання",
            "requirements": "Вимоги",
            "no_info": "Немає інформації"
        },
        "labels": {
            "name": "Назва раунду",
            "startDate": "Дата та час початку",
            "endDate": "Дата та час завершення",
            "task": "Завдання раунду",
            "requirements": "Вимоги до рішення",
            "save": "Зберегти зміни",
            "cancel": "Скасувати",
            "no_description": "Опис завдання ще не додано.",
            "no_requirements": "Вимоги до цього раунду не вказані.",
            "management": "Керування статусом раунду",
            "delete": "Видалити раунд"
        },
        "admin": {
            "edit_info": "Редагувати інформацію",
            "save": "Зберегти",
            "cancel": "Скасувати",
            "category_modal": {
                "title": "Додати категорію",
                "name": "Назва категорії",
                "weight": "Вага",
                "submit": "Створити категорію"
            },
            "jury_modal": {
                "title": "Призначити суддю",
                "id": "Введіть ID судді",
                "submit": "Призначити",
                "select": "Оберіть журі",
            }
        },
        "categories": {
            "add_category": "Додати категорію",
            "add_criteria": "Додати критерій",
            "criteria_text": "Текст критерію",
            "weight": "Вага:"
        },
        "jury": {
            "assign": "Призначити суддю",
            "remove": "Зняти суддю"
        },
        "teams": {
            "rank": "Місце",
            "team_name": "Назва команди",
            "email": "Email",
            "points": "Бали",
            "no_data": "Немає даних",
            "calculation_logic": "Логіка розрахунку балів",
            "assign_all": "Додати всі команди",
            "unassign_all": "Видалити всі команди",
            "formula": {
                "total_score_title": "Загальний бал команди",
                "jury_scores_sum": "Сума балів журі",
                "juries_count": "Кількість членів журі",
                "jury_score_title": "Розрахунок бала журі",
                "category_avg": "Сер. бал категорії",
                "weight": "Вага",
                "additional_points": "Додаткові бали",
            },
            "title": "Огляд команд",
            "all": "Усі команди",
            "leaderboard": "Лідерборд",
            "winners": "Переможці",
            "all_hint": "Повний список команд у цьому раунді з пагінацією.",
            "leaderboard_hint": "Живий лідерборд із балами, скролом і миттєвими оновленнями.",
            "name": "Команда",
            "members": "Учасники",
            "remove_from_round": "Видалити з раунду",
            "view_stats": "Переглянути статистику",
            "empty_all_title": "У цьому раунді ще немає команд",
            "empty_all_desc": "Спочатку додайте користувачів/команди до раунду, і тоді тут з'явиться список.",
            "empty_all_admin_title": "Потрібна дія адміністратора",
            "empty_all_admin_desc": "Додайте команди до цього раунду, щоб працювали пагінація, видалення та керування.",
            "all_title": "Усі команди раунду",
        },
        "stats_modal": {
            "title": "Статистика команди: {{teamName}}",
            "view_aggregated": "Сумарно",
            "view_detailed": "Детально",
            "criteria": "Критерій",
            "total": "Разом",
            "total_score": "ЗАГАЛЬНИЙ БАЛ",
            "close": "Закрити",
            "open": "Детальна статистика",
            "category_criteria": "Категорія / Критерія",
            "weighted_average": "Середнє зважене",
            "bonus_details": "Бонусна інформація",
            "jury": "Журі",
            "points": "Очки",
            "comment": "Коментарі",
            "no_bonus_points": "Відсутні бонусні очки",
            "loading": "Завантаження статистики...",
        },
        "common": {
            "actions": "Дії"
        },
        "submit_button": "Надіслати роботу",
        "submissions": {
            "auto_assign": "Автоматично призначити журі",
            "auto_assign_title": "Автоматично призначити журі",
            "auto_assign_desc": "Увведіть кількість журі на кожну роботу. Увага: ця дія видалить всі попередні призанчення, а також усі виставленні оцінки раніше!",
        },
        "actions": {
            "startRound": "Почати раунд",
            "closeSubmissions": "Закрити прийом робіт та почати оцінювання",
            "toDraft": "Повернути в чернетку",
            "evaluate": "Закінчити оцінювання",
            "rollbackStart": "Повернутися до відкриття подачі",
            "rollbackClose": "Відмінити закриття прийому"
        },
        "confirm": {
            "start": "Ви впевнені, що хочете почати цей раунд? Це дозволить учасникам бачити завдання.",
            "close": "Закрити прийом робіт? Після цього учасники не зможуть надсилати рішення.",
            "toDraft": "Повернути раунд у статус чернетки? Це приховає завдання від учасників.",
            "evaluate": "Закінчити процес оцінювання? Це змінить статус раунду та закриє доступ для журі.",
            "rollbackStart": "Відмінити початок раунду? Статус буде змінено на 'Активний', прийом робіт знову відкриється.",
            "rollbackClose": "Відмінити закриття оцінювання? Ви зможете переглянути результати раунду знову.",
            "delete": "Ви впевнені, що хочете видалити цей раунд? Цю дію неможливо скасувати.",
            "assignAllTeams": {
                "title": "Додати всі команди",
                "description": "Ви впевнені, що хочете додати ВСІ доступні команди з турніру до цього раунду?"
            },
            "unassignAllTeams": {
                "title": "Видалити всі команди",
                "description": "Ви впевнені, що хочете повністю очистити лідерборд і видалити ВСІ команди з цього раунду? Це не видалить команди з турніру."
            },
            "deleteRound": {
                "title": "Видалити раунд?",
                "description": "Цю дію неможливо скасувати. Продовжити?"
            },
            "removeJury": {
                "title": "Видалити журі?",
                "description": "Цей користувач більше не буде оцінювати раунд. Продовжити?"
            },
            "autoAssignJuries": {
                "title": "Автоматично призначити журі?",
                "description": "Ця дія перезапише всі поточні призначення."
            },
            "deleteCategory": {
                "title": "Видалити категорію?",
                "description": "Це також видалить усі критерії в цій категорії."
            },
            "deleteCriteria": {
                "title": "Видалити критерій?",
                "description": "Цю дію неможливо скасувати."
            },
            "removeTeam": {
                "title": "Видалити команду?",
                "description": "Команду буде відвʼязано від раунду. Продовжити?"
            },
            "exportFailed": {
                "title": "Не вдалося експортувати",
                "description": "Не вдалося завантажити файл лідерборду."
            },
            "deleteTask": {
                "title": "Видалити завдання?",
                "description": "Цю дію неможливо скасувати."
            },
            "deleteEvent": {
                "title": "Видалити подію?",
                "description": "Цю дію неможливо скасувати."
            },
            "deleteMessage": {
                "title": "Видалити оголошення?",
                "description": "Цю дію неможливо скасувати."
            }
        },
        "errors": {
            "updateRound": "Помилка оновлення раунду",
            "deleteRound": "Помилка видалення раунду",
            "assignJury": "Помилка призначення журі",
            "removeJury": "Помилка видалення журі",
            "autoAssignJuries": "Помилка автоматичного призначення журі",
            "loadJuries": "Помилка завантаження журі",
            "loadSubmissionsJuries": "Помилка завантаження доступних журі",
            "addCategory": "Помилка створення категорії",
            "deleteCategory": "Помилка видалення категорії",
            "addCriteria": "Помилка створення критерію",
            "deleteCriteria": "Помилка видалення критерію",
            "loadTeams": "Помилка завантаження команд",
            "addMissingTeams": "Помилка додавання команд",
            "advanceTeams": "Помилка переведення команд",
            "unassignTeam": "Помилка видалення команди",
            "loadStats": "Помилка завантаження статистики",
            "exportLeaderboard": "Помилка експорту лідерборду",
            "saveEvent": "Помилка збереження події",
            "deleteEvent": "Помилка видалення події",
            "saveMessage": "Помилка збереження повідомлення",
            "deleteMessage": "Помилка видалення оголошення",
            "saveTask": "Помилка збереження завдання",
            "deleteTask": "Помилка видалення завдання",
            "loadEventDetails": "Помилка завантаження деталей",
            "removeJuryFromSubmission": "Помилка видалення журі з сабмішну"
        }
    },

    submission: {
        "title_create": "Подача роботи",
        "title_update": "Оновити подачу",
        "subtitle": "Раунд: {{roundName}}",
        "fields": {
            "github": "Посилання на GitHub / Репозиторій",
            "video": "Посилання на відео-презентацію (YouTube/Drive)",
            "description": "Опис вашого рішення",
            "placeholder_desc": "Розкажіть коротко про вашу роботу..."
        },
        "status": {
            "not_submitted": "Робота ще не подана",
            "submitted": "Роботу подано",
            "edit": "Оновити роботу"
        },
        "actions": {
            "delete": "Видалити",
            "update": "Оновити",
            "submit": "Подати"
        },
        "alerts.locked": "Цей раунд зараз неактивний. Ви можете переглянути подані дані, але не можете їх змінити.",
        "submit_btn": "Надіслати на перевірку",
        "success": {
            "created": "Роботу успішно збережено!",
            "updated": "Роботу успішно оновленно!",
            "deleted": "Роботу успішно видаленно!"
        },
        "errors": {
            "save_failed": "Не вийшло зберегти роботу",
            "delete_failed": "Не вийшло видалити роботу",
            "load_failed": "Не вмйшло підвантажити інформацію про роботу",
        }
    },

    "notifications": {
        "round": {
            "created": "Створено новий раунд «{{roundName}}»",
            "started": "Раунд «{{roundName}}» розпочався!",
            "evaluated": "Опубліковано результати раунду «{{roundName}}»",
            "submission_closed": "Прийом робіт на раунд «{{roundName}}» завершено",
            "deadline_24h": "До дедлайну раунду «{{roundName}}» залишилося 24 години"
        },
        "jury_submission": {
            "assigned": "Вам призначено нову роботу від команди «{{teamName}}» (Раунд: {{roundName}})",
            "unassigned": "Перевірку роботи команди «{{teamName}}» було скасовано або перепризначено (Раунд: {{roundName}})"
        },
        "jury": {
            "assigned_to_round": "Вас призначено суддею на раунд «{{roundName}}»",
            "unassigned_from_round": "Вас усунено від суддівства в раунді «{{roundName}}»"
        },
        "points_changed": "Бали вашої команди «{{teamName}}» змінилися в раунді «{{roundName}}»",
        "team": {
            "created": "Створено нову команду «{{teamName}}»",
            "assigned_to_round": "Вашу команду «{{teamName}}» додано до участі в раунді «{{roundName}}»",
            "unassigned_from_round": "Вашу команду «{{teamName}}» знято з участі в раунді «{{roundName}}»",
            "user_added": "Ви приєдналися до команди «{{teamName}}»",
            "user_removed": "Ви покинули команду «{{teamName}}»",
            "user_set_to_leader": "Вас призначено капітаном команди «{{teamName}}»",
            "user_is_no_longer_leader": "Ви більше не є капітаном команди «{{teamName}}»"
        },
        "team_tasks": {
            "created": "Для вашої команди створено нове завдання «{{taskTitle}}»",
            "updated": "Завдання «{{taskTitle}}» було оновлено для команди «{{taskTitle}}»",
            "deleted": "Завдання «{{taskTitle}}» було видалено для команди «{{taskTitle}}»"
        },
        "round_admin_message": {
            "created": "Нове повідомлення від адміністратора раунду «{{roundName}}»"
        },
        "round_event": {
            "created": "До розкладу раунду «{{roundName}}» додано нову подію «{{eventName}}»",
            "before_1h": "Подія «{{eventName}}» розпочнеться за 1 годину"
        },
        "tournament": {
            "started": "Турнір «{{tournamentName}}» розпочався! Успіхів!",
            "finished": "Турнір «{{tournamentName}}» закінчився!"
        },
        "global": {
            "tournament": {
                "registration_started": "Реєстрацію на турнір «{{tournamentName}}» відкрито!"
            },
            "admin_message": "Глобальне оголошення від адміністрації"
        }
    },

    "calendar": {
        "title": "Календар подій",
        "filters_label": "Фільтрувати за типом",
        "next": "Наступний",
        "prev": "Назад",
        "today": "Сьогодні",
        "month": "Місяць",
        "week": "Тиждень",
        "day": "День",
        "agenda": "Розклад",
        "filters": {
            "show_reg": "Реєстрація",
            "show_running": "Турніри",
            "show_rounds": "Раунди",
            "show_offline": "Офлайн події",
            "show_online": "Онлайн події"
        }
    },

    timer: {
        "days": "д",
        "hours": "г",
        "minutes": "м",
        "seconds": "с",
    },

    "certificate": {
        "tabTitle": "Сертифікати",
        "tabHeadline": "Робочий простір сертифікатів",
        "tabDescription": "Створюйте шаблони, переглядайте їх у реальному часі, генеруйте сертифікати та підтверджуйте їх перед завантаженням.",

        "myCertificates": "Мої сертифікати",
        "myCertificatesHint": "Тут відображаються лише підтверджені сертифікати.",
        "noMyCertificates": "У вас ще немає підтверджених сертифікатів.",

        "templates": "Шаблони",
        "templatesHint": "Знайдіть і оберіть шаблон для генерації сертифікатів.",
        "noTemplates": "Шаблони відсутні.",
        "searchTemplates": "Пошук шаблонів",

        "createTemplate": "Створити шаблон",
        "createTemplateHint": "Створюйте сертифікат за допомогою блоків і полів, переглядайте його та зберігайте.",

        "templateName": "Назва шаблону",
        "templateBody": "Тіло шаблону",
        "templateBodyHelper": "Використовуйте HTML і змінні Thymeleaf, наприклад ${eventTitle}, ${participantName}.",
        "templateFile": "Файл шаблону",

        "downloadExample": "Завантажити приклад",
        "downloadDraft": "Завантажити чернетку",
        "resetDraft": "Скинути",
        "saveTemplate": "Зберегти шаблон",

        "uploadExistingTemplate": "Завантажити шаблон",
        "uploadExistingHint": "Завантажте HTML-файл з плейсхолдерами.",
        "chooseFile": "Обрати файл",

        "blocks": "Блоки",
        "fields": "Поля",
        "dragHint": "Перетягніть блок або поле. Поля додають змінні типу ${participantName}.",

        "preview": "Перегляд",
        "previewHint": "Живий попередній перегляд HTML.",

        "quickActions": "Швидкі дії",

        "generate": "Генерація",
        "generateCertificates": "Генерація сертифікатів",
        "generateHint": "Сертифікати будуть створені на основі шаблону та даних бекенду.",
        "generateHintShort": "Оберіть шаблон і згенеруйте сертифікати.",
        "generateForRound": "Для раунду",
        "generateForSelectedTeams": "Для вибраних команд",

        "teamIds": "ID команд",
        "teamIdsHelper": "ID через кому. Залиште порожнім для всіх команд.",

        "selectedTemplate": "Обраний шаблон",

        "createdByMe": "Створені мною",
        "createdByMeHint": "Перевіряйте та підтверджуйте сертифікати.",
        "noCreatedCertificates": "Ви ще не створювали сертифікати.",

        "certificate": "Сертифікат",
        "download": "Завантажити",

        "fields.eventTitle": "Назва події",
        "fields.participantName": "Ім’я учасника",
        "fields.teamName": "Команда",
        "fields.roundName": "Раунд",
        "fields.place": "Місце",
        "fields.score": "Бали",
        "fields.eventDate": "Дата",
        "fields.mentorName": "Ментор"
    },
};
